Tekla Open API Reference for Tekla Structures 2025
ClipPlane Methods
The ClipPlane type exposes the following members.
Methods
Name | Description
Delete
 Deletes the clip plane from the application view. The application view must be visible.
Insert
 Creates a new clip plane to the application view. The application view must be visible.
Modify
 Modifies the clip plane position in the application view. The application view must be visible.
Top
See Also
Reference
ClipPlane Class
Tekla.Structures.Model.UI Namespace